# GetRefPoint Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaLoad..::..GetRefPoint Method
AreaLoad Class See Also
---
Returns the physical location of the reference point.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ GetRefPoint(
	int index
)
```

Visual Basic
---
```text
Public Function GetRefPoint ( _
	index As Integer _
) As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetRefPoint(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The index of the point to return.
# Remarks
The index should be between 0 and less than NumRefPoints.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when index is out of range. |

# See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace